import { sectionHobbiesValue } from "../const"


export const mock = [
  {
    id: '1asdsadasdf',
    author: 'Вова',
    title: 'Восторг бешеный',
    ratings: [
      {
        author: 'Вов',
        rating: 5,
      },
      {
        author: 'Вово',
        rating: 5,
      },
      {
        author: 'Вови',
        rating: 1,
      },
      {
        author: 'Вуво',
        rating: 1,
      },
    ],
    nameOfPiece: 'God of war',
    group: sectionHobbiesValue.Games,
    likes: ['asdasd', 'asdadasd', 'asdsadasd', 'asdsadasd'], 
    tags: ['#1', '#2', '#3'],
    text: 'Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. ',
    image: 'https://t4.ftcdn.net/jpg/04/70/29/97/360_F_470299797_UD0eoVMMSUbHCcNJCdv2t8B2g1GVqYgs.jpg',
    grade: 10,
    comments: [
      {
        id: '214214124141',
        author: 'Вов',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '2142141241041',
        author: 'Вови',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124141sd',
        author: 'Вови',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124s141sd',
        author: 'Вову',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '21421a4124141sd',
        author: 'Вова',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '21421412414s1sd',
        author: 'Вова',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
    ],
  },
  {
    id: '2adsasdsadasd',
    author: 'Вови',
    title: 'Это дно',
    ratings: [
      {
        author: 'Вов',
        rating: 5,
      },
      {
        author: 'Вово',
        rating: 5,
      },
      {
        author: 'Вуво',
        rating: 1,
      },
    ],
    nameOfPiece: 'Старикам здесь не место',
    group: sectionHobbiesValue.Films,
    likes: ['asdasd', 'asdadasd', 'asdsadasd', 'asdsadasd'], 
    tags: ['#1', '#2', '#3'],
    text: 'Отличная фильм. Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. ',
    image: 'https://t4.ftcdn.net/jpg/04/70/29/97/360_F_470299797_UD0eoVMMSUbHCcNJCdv2t8B2g1GVqYgs.jpg',
    grade: 2,
    comments: [
      {
        id: '214a2141a24141sd',
        author: 'Вова',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: 'a214214124141sd',
        author: 'Вов',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: 'a2a14214124141sd',
        author: 'Вуви',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '2142141241sda41sd',
        author: 'Вова',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124asdasd141sd',
        author: 'Вово',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124445141sd',
        author: 'Вуви',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
    ],
  },
  {
    id: '3gasd',
    author: 'Вова',
    title: 'Это высота',
    ratings: [
      {
        author: 'Вов',
        rating: 5,
      },
      {
        author: 'Вово',
        rating: 5,
      },
      {
        author: 'Вови',
        rating: 1,
      },
      {
        author: 'Вуво',
        rating: 1,
      },
    ],
    nameOfPiece: 'Маленькая жизнь',
    group: sectionHobbiesValue.Games,
    likes: ['asdasd', 'asdadasd', 'asdsadasd', 'asdsadasd'], 
    tags: ['#1', '#2', '#3'],
    text: 'Отличная книга, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. ',
    image: 'https://t4.ftcdn.net/jpg/04/70/29/97/360_F_470299797_UD0eoVMMSUbHCcNJCdv2t8B2g1GVqYgs.jpg',
    grade: 8,
    comments: [
      {
        id: '2142141247887141sd',
        author: 'Вова',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214121264141sd',
        author: 'Вово',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124141p[ssd',
        author: 'Вов',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
    ],
  },
  {
    id: '4asfsafafafd',
    author: 'Вова',
    title: 'Дно донное',
    ratings: [
      {
        author: 'Вов',
        rating: 5,
      },
      {
        author: 'Вово',
        rating: 5,
      },
      {
        author: 'Вови',
        rating: 1,
      },
      {
        author: 'Вуво',
        rating: 1,
      },
    ],
    nameOfPiece: 'God of war',
    group: sectionHobbiesValue.Games,
    likes: ['asdasd', 'asdadasd', 'asdsadasd', 'asdsadasd'], 
    tags: ['#1', '#2', '#3'],
    text: 'Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. ',
    image: 'https://picsum.photos/400/400',
    grade: 1,
    comments: [
      {
        id: '214214124141sdasdads',
        author: 'Вуви',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '21421412b4141sd',
        author: 'Вово',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124141soid',
        author: 'Вов',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
    ],
  },
  {    
    id: '5asdsadsada',
    author: 'Вова',
    title: 'Чушь',
    ratings: [
      {
        author: 'Вов',
        rating: 5,
      },
      {
        author: 'Вово',
        rating: 5,
      },
      {
        author: 'Вови',
        rating: 1,
      },
      {
        author: 'Вуво',
        rating: 1,
      },
    ],
    nameOfPiece: 'Покерфейс',
    group: sectionHobbiesValue.Films,
    likes: ['asdasd', 'asdadasd', 'asdsadasd', 'asdsadasd'], 
    tags: ['#1', '#2', '#3'],
    text: 'Отличная фильм, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. ',
    image: 'https://picsum.photos/200/200',
    grade: 1,
    comments: [
      {
        id: '214214124141s45411d',
        author: 'Вови',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124141sl;lk;d',
        author: 'Вово',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '21421412414100ppsd',
        author: 'Вуво',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
    ],
  },
  {    
    id: '6a',
    title: 'Актуально всегда',
    author: 'Вов',
    ratings: [
      {
        author: 'Вов',
        rating: 5,
      },
      {
        author: 'Вово',
        rating: 5,
      },
      {
        author: 'Вови',
        rating: 1,
      },
      {
        author: 'Вуво',
        rating: 1,
      },
    ],
    nameOfPiece: 'Три товарища',
    group: sectionHobbiesValue.Games,
    likes: ['asdasd', 'asdadasd', 'asdsadasd', 'asdsadasd'], 
    tags: ['#1', '#2', '#3'],
    text: 'Отличная книга, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. Отличная игра, Я в диком восторге, как так можно вообще. ',
    image: 'https://picsum.photos/100/500',
    grade: 6,
    comments: [
      {
        id: '2142141241489871sd',
        author: 'Вуво',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124141sd90ffff',
        author: 'Вови',
        date: new Date(),
        textComment: 'Достойная книга, согласен. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
      {
        id: '214214124141ssdaaasddsd',
        author: 'Вово',
        date: new Date(),
        textComment: 'Достойная книга, согласна. Только что-то кратко ты пишешь, дружок. Разве это отзыв? Давай красноречивее.'
      },
    ],
  },
]